<details ><summary>apply for core 2024-12-26 11:22:46 (UTC)</summary>
  <details ><summary>Apply output</summary>

```terraform
OpenTofu will perform the following actions:

  # cloudns_dns_record.renterd will be updated in-place
  ~ resource "cloudns_dns_record" "renterd" {
        id    = "560336983"
        name  = "renterd-solo.node.testing"
      ~ value = "3n41003jk9add6fv35gnsj2ig4.ingress.ny-01.node.infra.lumeweb.com" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # cloudns_dns_record.renterd_s3 will be updated in-place
  ~ resource "cloudns_dns_record" "renterd_s3" {
        id    = "560336986"
        name  = "s3.renterd-solo.node.testing"
      ~ value = "3n41003jk9add6fv35gnsj2ig4.ingress.ny-01.node.infra.lumeweb.com" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.mysql.module.mysql_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.renterd.module.renterd_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

Plan: 2 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ mysql_endpoint      = "provider.ny-01.node.infra.lumeweb.com:30269" -> (known after apply)
module.mysql.module.mysql_deployment.akash_deployment.service: Creating...
module.mysql.module.mysql_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.mysql.module.mysql_deployment.akash_deployment.service: Still creating... [20s elapsed]
module.mysql.module.mysql_deployment.akash_deployment.service: Creation complete after 24s [id=19521109:1:1:akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
module.renterd.module.renterd_deployment.akash_deployment.service: Creating...
module.renterd.module.renterd_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.renterd.module.renterd_deployment.akash_deployment.service: Creation complete after 18s [id=19521113:1:1:akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
cloudns_dns_record.renterd: Modifying... [id=560336983]
cloudns_dns_record.renterd_s3: Modifying... [id=560336986]
cloudns_dns_record.renterd_s3: Modifications complete after 1s [id=560336986]
cloudns_dns_record.renterd: Modifications complete after 1s [id=560336983]

Apply complete! Resources: 2 added, 2 changed, 0 destroyed.

Outputs:

base_domain = "testing.pinner.xyz"
environment = "testing"
etcd_endpoint = "http://provider.ny-01.node.infra.lumeweb.com:30510"
etcd_password = <sensitive>
etcd_username = <sensitive>
mysql_endpoint = "provider.ny-01.node.infra.lumeweb.com:32604"
renterd_endpoint = "renterd-solo.node.testing.pinner.xyz"
renterd_s3_endpoint = "s3.renterd-solo.node.testing.pinner.xyz"

```
</details>
</details>